Revit 2027 API
FamilyManager.MakeInstance Method
Set the family parameter as an instance parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void MakeInstance(
	FamilyParameter familyParameter
)
Public Sub MakeInstance (
	familyParameter As FamilyParameter
)
public:
void MakeInstance(
	FamilyParameter^ familyParameter
)
member MakeInstance :
        familyParameter : FamilyParameter -> unit
Parameters
familyParameter FamilyParameter
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"familyParameter"-is null.
ArgumentException |  Thrown when the input argument-"familyParameter"-is an invalid parameter or a builtIn parameter.
InvalidOperationException |  Thrown when there is Type family parameter driven by this parameter. Or trying to make a parameter of image type to instance.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace